app/Controllers/Home.php

 public function buscar()
 {
     // Obtener el contenido del cuerpo (body) de la solicitud
     $json = $this->request->getBody();

     // Decodificar el contenido JSON en un array asociativo
     $data = json_decode($json, true);

     // Verificar si se proporcionó el ID en el cuerpo de la solicitud
     if (isset($data['id'])) {
         // Conectarse a la base de datos
         $db = \Config\Database::connect();

         // Obtener el ID del array de datos
         $id = strval($data['id']);

         // Realizar la consulta para buscar el registro con el ID especificado
         $query = $db->table('datosartista')->where('id', $id)->get();
---
SELECT *
FROM "datosartista"
WHERE "id" = '4'